#pragma once
#include <vector>

template <class T>
void insert(std::vector<T>& v, size_t elementIndex){

  size_t pos = 0;
  // намираме позицията на елемента
  // също забележете, че pos <= elementIndex, защото при равенство v[elementIndex] == v[pos] съответно цикъла ще приключи4
  // това означава, че тази функция обхожда само елементите от 0 до elementIndex
  while(v[elementIndex] > v[pos]){
    pos++;
  }

  // поставяме елемента на съответната позиция
  while(elementIndex > pos){
    std::swap(v[elementIndex], v[elementIndex - 1]);
    elementIndex--;
  }
}

// сложност по време: О(n) 
// сложност по памет: O(1)

template <class T>
void insertionSort(std::vector<T>& v){
  for(size_t i = 0; i < v.size(); i++){
    insert(v, i);
  }
}

// защо работи?
// така написан алгоритъмът има следното свойство:
// преди i-тата итерация на for цикъла на ред 22 v[0 ... i - 1] е сортиран 
// (Записът v[0 ... i - 1] онзачава елементите на v с индекси от 0 до i - 1 включително. Ако i - 1 < 0, считаме v за празен)
// във функцията insert взимаме елемента на позиция i и го вмъкваме във v[0 ... i - 1] => преди (i + 1)-вата итерация на цикъла
// v[0 ... i] също ще е сортиран
// тогава по индукция v[0...n-1] ще е сортиран след изпълнението на алгоритъма 

// сложност по време: O(n^2)
// сложност по памет: O(1)